Revit 2026 API

# AssemblyDifferenceMemberCount Class

---

The two assemblies being compared have different number of members

SystemObject Autodesk.Revit.DBAssemblyDifference Autodesk.Revit.DBAssemblyDifferenceMemberCount

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssemblyDifferenceMemberCount : AssemblyDifference
```
```vb
Public Class AssemblyDifferenceMemberCount
	Inherits AssemblyDifference
```
```cpp
public ref class AssemblyDifferenceMemberCount : public AssemblyDifference
```
```fsharp
type AssemblyDifferenceMemberCount =
    class
        inherit AssemblyDifference
    end
```

The AssemblyDifferenceMemberCount type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Count1 | Number of members in the first assembly |
|  | Count2 | Number of members in the second assembly |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from AssemblyDifference) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from AssemblyDifference) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace